<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Recipe description</string>
	<key>Identifier</key>
	<string>com.github.boustba.download.ZoomIT</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ZoomIT</string>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
			  <key>url</key>
			  <string>https://zoom.us/client/latest/ZoomInstallerIT.pkg</string>
            </dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Zoom Video Communications, Inc. (BJ4HAAB9B3)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
        </dict>
	</array>
</dict>
</plist>
