<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current Adobe Acrobat Reader DC and extracts the installer package.</string>
    <key>Identifier</key>
    <string>com.github.boustba.pkg.AdobeReaderDCUpdate</string>
    <key>Input</key>
    <dict>
        <key>LANGUAGE</key>
        <string>English</string>
        <key>MAJOR_VERSION</key>
        <string>AcrobatDC</string>
        <key>NAME</key>
        <string>AdobeReaderDC</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.boustba.download.AdobeReaderDCUpdate</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/*.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
