<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Recipe description</string>
	<key>Identifier</key>
	<string>com.github.boustba.download.Office2016Suite</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Office2016Suite</string>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.0</string>
	<key>Process</key>
    <array>
		<dict>
            <key>Processor</key>
            <string>OfficeSuiteSKULessVersionProvider</string>
			<key>Arguments</key>
            <dict>
                <key>installertype</key>
				<string>vl2016</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
			  <key>url</key>
			  <string>https://go.microsoft.com/fwlink/?linkid=871743</string>
              <key>filename</key>
              <string>%NAME%-%version%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Microsoft Corporation (UBF8T346G9)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
